[
  {
    "company": "Straal",
    "role": "Python Developer",
    "date": "06/2019 - Present",
    "location": "Warsaw, Poland",
    "description_bullets": [
      "Straal is an online payment service for businesses. ",
      "I've been developing and coordinating work for a tool used to prepare mock transaction data for internal use.",
      "Another project is an internal web application for managing customers.",
      "I've got back to Python and PostgreSQL after a few years break and also become familiar with asyncio."
    ]
  },
  {
    "company": "Grupa Wirtualna Polska",
    "role": "Senior Software Developer",
    "date": "11/2018 - 06/2019",
    "location": "Warsaw, Poland",
    "description_bullets": [
      "Continuation of my previous role at Grupa Wirtualna Polska."
    ]
  },
  {
    "company": "Grupa Wirtualna Polska",
    "role": "Software Developer",
    "date": "03/2014 - 11/2018",
    "location": "Warsaw, Poland",
    "description_bullets": [
      "Most of the time I was a part of the team developing an e-mail service for poczta.o2.pl and poczta.wp.pl (aaproximately 9 million monthly real users). ",
      "Learned and used mainly Golang and how to write microservices, REST APIs.",
      "Other technologies I've used: Cassandra, Redis, GCM/FCM, Kafka, ZMQ, websockets, Python, Elastic Search, MySQL, Grafana, Docker, Gitlab CI, Hadoop Query Language, Flask.",
      "I've had experience also with processing large streams of events and authenticating users.",
      "Other small projects: developing a Python tool for Ceph synchronization"
    ]
  },
  {
    "company": "Grupa o2",
    "role": "Python/Django Developer",
    "date": "07/2013 - 02/2014",
    "location": "Warsaw, Poland",
    "description_bullets": [
      "I was a part of the team developing wrzuta.pl (a Polish video and audio streaming service). ",
      "Technologies I've used: Python, Django, Redis, Elastic Search.",
      "After six months Grupa o2 joined with Grupa Wirtualna Polska."
    ]
  },
  {
    "company": "National Institute of Telecommunications",
    "role": "Python/Django Developer",
    "date": "09/2012 - 07/2013",
    "location": "Warsaw, Poland",
    "description_bullets": [
      "Developing two applications for reporting various things for public institutions.",
      "One of them was for reports about broadband networks and the other for reporting funds from the EU.",
      "Both projects were using Python and Django."
    ]
  },
  {
    "company": "Esensive and KOM-NET Sp. z o.o",
    "role": "Python developer",
    "date": "11/2010 - 09/2012",
    "location": "Toruń, Poland",
    "description_bullets": [
      "Developing a backbone in Python for running programs in Python and R written by data scientists.",
      "I was a part of small team (2-5 people), technologies used: Python, Cassandra",
      "Some other minor projects using technologies such as Java, PostGIS"
    ]
  }
]